;  搜狗输入法--自定义短语配置文件

;  自定义短语说明：
;  1、自定义短语支持多行、空格、指定位置。
;  2、每条自定义短语最多支持30000个汉字，总共支持100000条自定义短语。
;  3、自定义短语的格式如下：

;  单行的格式：
;  字符串+英文逗号+数字（指定排序位置）=短语

;  多行的格式：
;  字符串+英文逗号+数字（指定排序位置）=
;  多行短语

;  具体格式可以参考下面的实例。
;  4、最多支持100000行自定义短语。
;  5、自定义短语的用途有：快捷输入手机号、邮箱、诗词、小短文等，大家可以自由发挥。
;  6、时间函数功能。具体定义格式如下：;  字符串+英文逗号+数字（指定排序位置）=#表达式
;  注意：表达式以英文#开头，后面的表达式中的每一个函数的前面都包含有英文$。
;  函数表如下：
;  函数    	含义    	举例
;  $year    	年(4位) 	2006、2008
;  $year_yy	年(2位) 	06、08
;  $month     	月      	12、8、3
;  $month_mm  	月      	12、08、03		//此函数在输入法3.1版之后（含）有效
;  $day     	日      	3、13、22
;  $day_dd	日	       03、13、22	//此函数在输入法3.1版之后（含）有效
;  $weekday 	星期    	0、1、2、5、6
;  $fullhour	时(24小时制)  	2、8、13、23
;  $fullhour_hh	时(24小时制)  	02、08、13、23		//此函数在输入法3.1版之后（含）有效
;  $halfhour	时(12小时制)	2、8、10、11
;  $halfhour_hh	时(12小时制)	02、08、10、11		//此函数在输入法3.1版之后（含）有效
;  $ampm    	AM、PM(英)	AM、PM（大写）
;  $minute  	分      	02、08、15、28
;  $second  	秒      	02、08、15、28
;  $year_cn 	年(中文4位)	二〇〇六
;  $year_yy_cn	年(中文2位)	〇六
;  $month_cn	月(中文)	十二、八、三
;  $day_cn  	日(中文)	三、十三、二十二
;  $weekday_cn 	星期(中文)	日、一、二、五、六
;  $fullhour_cn	时(中文24时制)	二、八、十三、二十三
;  $halfhour_cn	时(中文12时制)	二、八、一、十一
;  $ampm_cn 	上午下午(中文)	上午、下午
;  $minute_cn	分(中文)	零二、零八、十五、二十八
;  $second_cn	秒(中文)	零二、零八、十五、二十八
;  具体你可以参考这个文件最下面的例子，实际体验一下就明白了。
;  你可以用自定义短语来做一个带动态时间的多行回信落款。
;  ss,1=#$year年$month月$day_dd日 $fullhour:$minute:$second

average,1=(define (average x y) (/ (+ x y) 2))
fs,1=
一、初始目标
最初的期待；直觉的想法。【当初思考时，我考虑了这件事情的目标了吗？如果考虑了，当初的目标是什么？】
1.
二、考虑因素
在这个目标下，我当时考虑了哪些因素？现在看，这些因素合理吗？有遗漏吗？
（一）考虑了什么因素？
1.
（二）这些因素合理吗？
1.
（三）有没有遗漏？
1.
三、假设模型
（一）我当时为什么会这样考虑？
1.
（二）各种因素中，哪个条件发生变化，结果可能不一样？
1.
四、差距归因
（一）最后的结果和我的预期之间有什么差距？
期待：
实际：
（二）为什么？

更深层次反思：为知搜“永澄反思模板”， 再深层，是创造，而不是解决问题，改变结构，环境，woop,微习惯。

gz,1=
## 一、今日计划
#### 我今天的任务共X件，根据优先级安排如下：
1. xxxxxx任务：
    * 成果：
    * 完成度：
2. xxxxxx任务：
    * 成果：
    * 完成度：
3. xxxxxx任务：
    * 成果：
    * 完成度：
4. xxxxxx任务：
    * 成果：
    * 完成度：
5. xxxxxx任务：
    * 成果：
    * 完成度：
6. xxxxxx任务：
    * 成果：
    * 完成度：
加油，完成它！
----
## 二、工作记录
#### 上午
HHMM 
hexogd,1=
git config --global alias.fuck '!cd /Users/tanliang/Hexoblog;hexo clean;hexo g -d'
git fuck


hexon,1=hexo new post title
id,1=hiddenwangcc
js,1=#$fullhour:$minute 
ks,1=#$fullhour:$minute
port,1=
## 目的
1. 
2. 
3. 
## 目标
- 范围：
- 进度：
- 质量：
- 成本：
## 关键成果
1. 
2. 
3. 
## 重点任务
1. 
2. 
3. 

rhg,2=
按日计划执行：
做得好的地方：
不足之处：（感受）
原因（一步步逼问，底层原因，集思广益）：       
这样做的假设是什么
经验沉淀：
对策：
花15分钟自述昨天：  
**加油！！新的一天要开始了！！**
*********
rqm,1=#$year_yy$month_mm$day_dd-周$weekday_cn.md
rzxwlf,1=
###事件是？
###详细说出自己的情绪，身体有什么感受，哪里不舒服？
###你为什么有这种情绪呢？信念是什么？
这是合理的证据吗？真的吗？有没其它可能
这个推理有问题吧？
就算是真的，我这么想有什么用呢？
###我能控制的是什么？可以有哪些行动？
square,1=(define (square x) (* x x))
st,5=
#
## 日期：
**SRAR说明**
- S：
- T：
- A：
	- 
- R：
**经验**
-
-
**方法**
-
vimth,1=
%s/y/m/g, 1,3s/y/m/g

woop,1=

姓名：                                             日期：

************
###W:Wish(愿望）
你内心一直想去实现的愿望是什么？您希望用_______的时间来实现？
注：目标/愿望应该是可实现并有立挑战的。用三到六个字写下你的答案吧。
*************
###W:Outcome（成果）
实现以上愿望后，你能想到的最好的图景是什么？你的心情如何？
注：图景越清晰越好。来，闭上眼睛，好好地想象一下。
*************
###Obstacle（困难）
为了实现你的愿望，你将会遇上何种的困难？列个清单吧（至少四项）。
注：图景越清晰具体越好。来，闭上眼睛，好好地想像一下。
**************
###P:Plan（应对）
你将如何应对以上的困难？
如果：
那么我将：
如果：
那么我将：









xbzyl,1=
假想奇迹发生了，你真的实现了改变，会发生什么？回溯这一过程，你迈出的第一步是什么？



xlmy,1=
用于走出舒适区，没做过的行为。因为之前经验的影响。大象不喜欢不确定性，不

###希望达成的目标（行动目标）：开始学编程课程，开始学课程

###与目标相反的行为：一直没行动

###潜在的好处是或不这么做，你担心什么？：我怕会发现我那么多不懂，很多要从头学

###内心重大的假设（如果...就...）：如果开始，就会发现很多不懂。去年有这经历。为什么怕不懂？想学快点？还是想快点改变现状。

###行为检验，安排几次小尝试：试着拥抱这种不懂，不懂之后的后悔情绪

xmh,1=
- P-目的：写出本任务的目的，至少3条，每个目的都要让自己看了之后有能量，想要动起来去做
- O-目标：说明本任务要达成什么样的，这里嵌套RSQC模型。
- R-范围目标：
- Q-质量目标：
- C-成本目标(时间要具体,调用woop流程)：
- O-思路：做这件事情，如果用3-5步完成，你的思路是什么呢？（比如学习原理刻意练习，作品声音）
- R-成果：在每个思路上，最重要的成果是什么？
- T-任务：为了完成这些成果，都需要做哪些任务呢？
- 调用复杂任务模型，找人监督，拉群


***
# 分心工作法
### 经验：
### 方法：
###问题：

xmhe,1=
***
# STAR记录法：（防止自动完成，要刻意练习，在最小化的时候自己写一遍代码，之后迭代听课都会更容易，比如写那个服务器程序）
### S:背景及存在问题
### T:任务
### A:行动
### R:结果
***
# 复盘：
### 目的：
### 目标：
### 结果：
- 亮点：
- 不足：
### 假设：（原因一步步逼问）
- 亮点：
- 不足：

### 规律经验：
### 下一步及假设：
# 萃取成果：包括经验，知识，方法

yhg,1=
- 当初立项的环境还在不在？参考项目文件，一一对照当时环境是否变了。比如编程100天项目。
- 根据时间统计，统计下第一目标有多少，时间分配是否平衡。用做下月计划参考。
- 剪掉脚指甲
- 安排一次大强度间歇，上月跑步是否宁静，如否，把跑表放别处
- 当月决策是不是自下而上，比如早上起来想那个
- excel表要更新一下，比如编程加上这个月的里程碑


zhg,2=
zhg,2=

月回顾(如果上月做了且不是1-10号，pass)
### 冗余
有没有看最近的投资机会，科技发展？现在去看半小时
理发，剪脚指甲
### 人脉
最近有没有联系同频的伙伴？花半小时联系下。
- 改变最近的行为模式，如果看书多，那么走出舒适，去交际，交流地学习，  上班。
- 有没有花一个小时去想家人，比如跟妈聊天，比如跟小猪猫玩下游戏，看下书。
- 花15分钟看上个月写的笔记 
- 为知搜：“阅读流程化”上个月看的书，没写笔记写笔记，不用发表。或者去豆瓣知乎评论。独学而无友，则孤陋而寡闻。有没新东西写到原则库，流程库？
***********************
周回顾
> 下面一项目项执行，而不是光看！！

# 短：
- 打印出周计划，以及第一目标的进度表格
- 整理日计划中的待办事件，买进口奶，护肤品，买淘宝上的水果。
- 第一目标投入多少时间，统计这周输出多少笔记，发布多少博客文章。
- 在“成就事件”里写成就事件，也写上幸福的一件小事。
- 去投资反思文件写价值感知练习，并发到外网上。写最近的感受，做出决策的依据。
- 在备忘录里更新日计划模板，上面写：看昨天的计划，上周未完成的计划。
- 跟家人沟通，需求说给他们听。也问问他们有什么需求，有什么不满？
- 上周计划没完成80%，这周晚上就没奖励，周三也没好吃的！
- 上周浪费很多时间的APP卸掉。有哪些阻碍早睡的书。把它放在别的地方。譬如最近一早上起来就会玩豆瓣，那么把豆瓣卸掉。
- 参考对标表，这周几乎都是0的要执行下。比如需求沟通。
- 加是否有用生成效应练习 code，是否拿15分钟回忆昨天所学的？
- 如果这周状态差，提醒妈，小猪猫提醒发红包，叫妈加紧监督
- 把银行卡的钱存到支付宝，或者把银行卡放别人身边，避免晚上夜宵或出去玩
- 用漱口水漱口
- 按摩眼睛10分钟
- 站桩10分钟，按摩脚底，宾胫束5分钟
-  这周没吃香蕉，就去买来吃，

- 项目管理方面
现在叫人监督
- 做事方法：（调用"rhg"）
- 复习：（1号-7号）
英语书上单词
英语单词
读书笔记
### 学习
有没有刻意练习：跑步还是那么慢？组块？反馈？走出舒适区
### 家庭
- 有没有爱，拥抱和语言，女人喜欢你表达出来。现在就可以通过语言知识星球表达。
- 对小孩爱人有没有体贴，惊喜。现在就可以买，用快递。
- 有没有花时间引导ta们，而不是说教？


### 对标： 
积极主动：
严以律己，宽以待人： 
以始为终：（想想五年前想学编程，学下来现在也积累几年了。积累复利能力圈才有竞争优势）
知已知彼，双赢沟通（家人同学同事，包括我的需求不满，在星球写！异步沟通）
挑战：在编程领域不断地精进，刻意练习。那些年都是没有没有方向的挑战，比较泛
注意看到美女，就觉察不能多看

助人：
- 时间管理方面：
- 精力管理方面：
做人做事：为知搜索“做人原则
有没有太急躁？我经常出现。比如那几次世界杯发朋友圈，手都在抖，恨不得马上让别人看到。比如那次李学鹏，我迟到了，在地铁上很急，还说只有三个站，其实有五个站。那次坤坤来，也是很急，怕的是什么？还不是面子。不稳重的人，很难成大事的！
早睡
10点15点，有没有挺胸？
少吃多餐
运动


# 长：
- 借钱买比特币，5万。装比特币钱包，不然火币上的币都会没了！
- 写这周的反思，如果最近状态差，比如2019年的7月，那么从头到尾看下习惯养成，项目启动文件，比如100天编程计划
- 用沉浸工作法写一篇文章，发到博客上。让别人知道你，更好地合作！或者写1个小时也行，分一个月写一篇。或者录制一个课程到youtube,或者bilibili


- 花半小时简单写看过书的笔记，有个闭环
- 这周吃青菜了吗，晚上吃香蕉了吗，没有的话现在就去买，现在就吃！

> 感恩所有，珍惜身边人，珍惜现在有的！

zjh,2=
> 如果是第一周，那么停下来！至少准备8个小时做月计划，反思。别急着赶路！目的是成长！！！
不要闷头看书，多做项目，多交流地学习。思考自己的问题！！建群学习，教别人。复习学过的！！走出舒适区！！！

### 6月1日周计划：（！！！去看月计划，写成果，字体加粗）
！！！是否平衡，身体有力量训练，柔性练习？学习有必要难度，有输出，有项目？
身体：
跑步25公里，1次间歇5公里，1次80分有氧耐力：
早睡：
晚餐：
学习：（！！！参考年目标第一目标！）
家庭娱乐：
事业，理财，人脉：
### 6月9日周执行统计：（盘点战利品了！！盘点创造的作品了！！）
第一目标（学编程）：
发到博客作品：
输出：
身体：
早睡：
跑步：（）次间歇跑6公里，（）次70分钟有氧耐力跑。
晚餐：
家庭：
